
# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "eza"
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
brew "lazygit"
# NCurses Disk Usage
brew "ncdu"
brew "neovim"
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
brew "thefuck"
brew "wget"
brew "yadm"
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
cask "iina"
cask "raycast"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Team communication and collaboration software
cask "slack"
